; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-6-6)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city2)
	(fuel-level plane1 fl4)
	(at plane2 city9)
	(fuel-level plane2 fl4)
	(at plane3 city7)
	(fuel-level plane3 fl6)
	(at plane4 city9)
	(fuel-level plane4 fl5)
	(at plane5 city7)
	(fuel-level plane5 fl6)
	(at plane6 city5)
	(fuel-level plane6 fl3)
	(at person1 city4)
	(at person2 city4)
	(at person3 city3)
	(at person4 city1)
	(at person5 city1)
	(at person6 city6)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane1 city5)
	(at plane2 city6)
	(at plane3 city4)
	(at plane5 city7)
	(at person1 city6)
	(at person2 city9)
	(at person3 city3)
	(at person4 city0)
	(at person5 city5)
	))

)

; plan
1. (zoom plane3 city7 city1 fl6 fl5 fl4)
   deleted: (at plane3 city7) (fuel-level plane3 fl6)
   added: (at plane3 city1) (fuel-level plane3 fl4)
   goals met: 2 of 9
2. (zoom plane3 city1 city4 fl4 fl3 fl2)
   deleted: (at plane3 city1) (fuel-level plane3 fl4)
   added: (at plane3 city4) (fuel-level plane3 fl2)
   goals met: 3 of 9
3. (board person2 plane3 city4)
   deleted: (at person2 city4)
   added: (in person2 plane3)
   goals met: 3 of 9
4. (board person1 plane3 city4)
   deleted: (at person1 city4)
   added: (in person1 plane3)
   goals met: 3 of 9
5. (zoom plane2 city9 city1 fl4 fl3 fl2)
   deleted: (at plane2 city9) (fuel-level plane2 fl4)
   added: (at plane2 city1) (fuel-level plane2 fl2)
   goals met: 3 of 9
6. (board person5 plane2 city1)
   deleted: (at person5 city1)
   added: (in person5 plane2)
   goals met: 3 of 9
7. (board person4 plane2 city1)
   deleted: (at person4 city1)
   added: (in person4 plane2)
   goals met: 3 of 9
8. (zoom plane1 city2 city5 fl4 fl3 fl2)
   deleted: (at plane1 city2) (fuel-level plane1 fl4)
   added: (at plane1 city5) (fuel-level plane1 fl2)
   goals met: 4 of 9
9. (zoom plane2 city1 city0 fl2 fl1 fl0)
   deleted: (at plane2 city1) (fuel-level plane2 fl2)
   added: (at plane2 city0) (fuel-level plane2 fl0)
   goals met: 4 of 9
10. (refuel plane2 city0 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 4 of 9
11. (debark person4 plane2 city0)
   deleted: (in person4 plane2)
   added: (at person4 city0)
   goals met: 5 of 9
12. (fly plane2 city0 city5 fl1 fl0)
   deleted: (at plane2 city0) (fuel-level plane2 fl1)
   added: (at plane2 city5) (fuel-level plane2 fl0)
   goals met: 5 of 9
13. (refuel plane2 city5 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 5 of 9
14. (debark person5 plane2 city5)
   deleted: (in person5 plane2)
   added: (at person5 city5)
   goals met: 6 of 9
15. (fly plane2 city5 city6 fl1 fl0)
   deleted: (at plane2 city5) (fuel-level plane2 fl1)
   added: (at plane2 city6) (fuel-level plane2 fl0)
   goals met: 7 of 9
16. (zoom plane3 city4 city6 fl2 fl1 fl0)
   deleted: (at plane3 city4) (fuel-level plane3 fl2)
   added: (at plane3 city6) (fuel-level plane3 fl0)
   goals met: 6 of 9
17. (refuel plane3 city6 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 6 of 9
18. (debark person1 plane3 city6)
   deleted: (in person1 plane3)
   added: (at person1 city6)
   goals met: 7 of 9
19. (fly plane3 city6 city9 fl1 fl0)
   deleted: (at plane3 city6) (fuel-level plane3 fl1)
   added: (at plane3 city9) (fuel-level plane3 fl0)
   goals met: 7 of 9
20. (refuel plane3 city9 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 7 of 9
21. (debark person2 plane3 city9)
   deleted: (in person2 plane3)
   added: (at person2 city9)
   goals met: 8 of 9
22. (fly plane3 city9 city4 fl1 fl0)
   deleted: (at plane3 city9) (fuel-level plane3 fl1)
   added: (at plane3 city4) (fuel-level plane3 fl0)
   goals met: 9 of 9
